{
    "version": "https://jsonfeed.org/version/1",
    "title": "yashKarthik",
    "home_page_url": "https://www.yashkarthik.xyz",
    "feed_url": "https://www.yashkarthik.xyz/feed.json",
    "description": "Essays by yashKarthik on web3, programming, and physics",
    "icon": "https://www.yashkarthik.xyz/thelatenightbuilders.png",
    "author": {
        "name": "yashkarthik.eth",
        "url": "https://twitter.com/_yashKarthik"
    },
    "items": [
        {
            "id": "https://www.yashkarthik.xyz/archive/pouring-liquids",
            "content_html": "<p>You know when you&#x27;re trying to pour a liquid from a mug into another container and instead flowing out of the mouth into the container, it dribbles over the lip, to the sides making a mess on the kitchen slab.</p>\n<h2>Why</h2>\n<p>When a liquid is being poured out of the container an adhesive force is formed between the liquid and the container. Adhesion is the net result of <a href=\"https://en.wikipedia.org/wiki/Van_der_Waals_force\">Van der Waals force</a>, <a href=\"https://en.wikipedia.org/wiki/Coulomb%27s_law\">Coulombic forces</a> and <a href=\"https://en.wikipedia.org/wiki/Hydrogen_bond\">Hydrogen bonding</a>. Gravity has to fight against this adhesion to make the liquid <em>fall</em> out of the container.</p>\n<p>For an optimal pouring action, we need to minimize the adhesion between the liquid and the container, and maximize the force of gravity on the water.</p>\n<p>Since the adhesion depends on the surface properties of the container (roughness, wetting props etc), we can choose a less adhesive container (I think steel over ceramic mugs). Looking closer at adhesion, in general the adhesion between two surfaces rises as the the time of contact between them increases. So pouring the liquid faster would reduce its adhesion to the container, reducing dribbling down the sides. Pouring faster would also allow us to take advantage of the momentum mustered.</p>\n<p>Another route could be maximizing the force of gravity on the dribbling water, till the force of gravity is larger than the adhesive force. This is pretty intuitive to us humans, we tilt the mug till gravity beats the adhesion, but the physics/math behind it is pretty interesting too.</p>\n<p><img src=\"/blog-assets/pouring.png\" alt=\"Gravity pulling water\"/></p>\n<p>Since gravity has act to against the adhesive force, we split force of gravity into two\nmutually perpendicular <em>components</em> using trigonometry. This helps us visualize (and calculate) how much of gravity\nis acting against the adhesion. When the tilt angle is small, the angle (θ) between the force of gravity\nand the container&#x27;s surface is small. So the force acting against the adhesion F•sinθ is relatively small.\nTilting increases that angle θ, hence increasing F•sinθ (the component of gravity acting against adhesion).\nAfter a certain point, the pull against the adhesion is too much and water flows.</p>\n<hr/>\n<p><strong>References / Further Reading:</strong></p>\n<ul>\n<li><a href=\"https://physics.stackexchange.com/questions/28982/why-does-water-pouring-from-a-glass-sometimes-travel-down-the-side-of-the-glass\">Physics Stackexchange</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Van_der_Waals_force\">Van der Waals force</a>,</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Coulomb%27s_law\">Coulombic forces</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Hydrogen_bond\">Hydrogen bonding</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Cohesion_(chemistry)\">Cohesion</a></li>\n<li><a href=\"https://phys.libretexts.org/Bookshelves/University_Physics/Book%3A_Physics_(Boundless)/10%3A_Fluids/10.4%3A_Cohesion_and_Adhesion\">Adhesion</a></li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/pouring-liquids",
            "title": "How to pour water, without making a mess.",
            "summary": "Understanding the whimsically annoying.",
            "date_modified": "2023-01-09T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/2023",
            "content_html": "<p>I remember when 2022 started and I had a list of things I wanted to learn. Looking back I can see that I made some progress but also fell short in a few areas. In 2023 I want to be more specific and focused in my learning goals (also, I&#x27;m announcing them publicly so I feel more accountable).</p>\n<p>So what <em>am</em> I gonna learnt?</p>\n<h1>Ethereum Stack</h1>\n<p>I have a decent understanding of the different parts of Ethereum development–Solidity, JS libraries etc–but never built a full-fledged project that covers the entire stack. This year, I&#x27;m planning to do <a href=\"https://speedrunethereum.com/\">Speedrunethereum</a> to understand building Dapps.</p>\n<h2>Solidity</h2>\n<p>It&#x27;s JS-like syntax is deceptive and now I know there&#x27;s a lot for me to learn. I&#x27;m gonna dive into this by building Dapps and doing Solidity CTFs. I really enjoyed OpenZeppelin&#x27;s <a href=\"https://ethernaut.openzeppelin.com/\">Ethernaut</a> challenges and looking for more.</p>\n<h1>Non-crypto Software</h1>\n<h2>Languages</h2>\n<p>I started with Scratch, then Python and now almost every project I build is in Typescript. I love TS, but... I feel like learning a new language. I&#x27;m split between Go and Rust. I&#x27;m probably gonna start with Go and delve into lower level languages later on when I&#x27;m exploring hardware projects.</p>\n<h2>Miscellaneous</h2>\n<ul>\n<li>I really need to understand auth. Theo&#x27;s video on <a href=\"https://www.youtube.com/watch?v=h6wBYWWdyYQ\">this</a> is really good, but I never got around to implementing it in my apps.</li>\n<li>AI seems to be the rage right now. While I&#x27;m not diving <em>deep</em> into it, I&#x27;ll probably build more SaaS-like projects that use AI apis. Recently: <a href=\"https://skimmr.xyz\">Skimmr</a>.</li>\n</ul>\n<h1>Hardware</h1>\n<p>I&#x27;ve explored hardware in the past, that&#x27;s how I got into coding/tech, but haven&#x27;t done much since the pandemic hit. Last summer I bought a Raspberry Pi 4 and built an automated door handle for my room with it. And recently I won an <a href=\"https://leap-site.hackclub.dev/\">Orpheus Leep</a>(similar to Arduino) in the <a href=\"https://epoch.hackclub.com/\">Epoch</a> hackathon. Haven&#x27;t done much research into this space, but I think I&#x27;ll start from the basics with C and Orpheus Leep and see where it takes me.</p>\n<h1>Writing</h1>\n<p>I discovered my interest in writing after writing a Twitter thread.</p>\n<p>This year, I plan to write more code-explanations and &quot;How it Works&quot; of open-source apps, particularly crypto protocols. I want to continue writing about my other interests and learnings from them. I&#x27;m also interested in trying out short stories.</p>\n<hr/>\n<p>Feels good declaring all this publicly. I&#x27;m excited to see where 2023 takes me.</p>",
            "url": "https://www.yashkarthik.xyz/archive/2023",
            "title": "2023",
            "summary": "I'm split about New Year's Resolutions, but I like \"time reset\" they bring.",
            "date_modified": "2023-01-01T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/skimmr",
            "content_html": "<p>As screenshots of ChatGTP giving startup ideas and writing Twitter threads covered my feed, I figured ChatGPT could be my reading assistant. After trying that for a couple of days, I found that while ChatGPT helped, the constant back-and-forth, between an article and the ChatGPT page, was distracting and it slowed me down.</p>\n<p>I began looking for ways to &quot;embed&quot; ChatGPT into a webpage and that’s when I remembered browser extensions. This way, I could also learn how browser extensions worked.</p>\n<h1>High-level Overview</h1>\n<p>The basic idea is that the user selects some text, right-clicks and presses the <em>Skimmr</em> button. The click from the user would trigger a serverless function that would do some preprocessing and rate-limiting and then call OpenAI&#x27;s endpoint. The response will be updated in the extension UI.</p>\n<h1>Backend</h1>\n<p>The backend is essentially a single TS file that exports a function of type <code>Handler</code>, which inherits from type <code>Response</code>:</p>\n<pre><code class=\"language-ts\">export interface Response {\n\tstatusCode: number;\n\theaders?: {\n\t  [header: string]: boolean | number | string;\n  };\n\tmultiValueHeaders?: {\n\t\t[header: string]: ReadonlyArray&lt;boolean | number | string&gt;;\n  };\n  body?: string;\n  isBase64Encoded?: boolean;\n}\n</code></pre>\n<p>The function body itself is pretty straightforward. The function is meant to be called by a POST request, so for other methods (like OPTIONS for browser preflight), I return status code 200,  Access-Control headers and JSON body saying call with POST. I also check that the body sent (POST request) is long-enough to even require summarization.</p>\n<h2>Rate-limiting</h2>\n<p>Internet is a cruel place :(</p>\n<p><a href=\"https://upstash.com/\">Upstash</a> is a great Redis service and their <a href=\"https://github.com/upstash/ratelimit\">rate-limiting</a> library is super simple. Before calling OpenAI&#x27;s endpoint, I call the DB hosted on Upstash for prev-requests&#x27; metadata to check if the same user has been calling the function.</p>\n<pre><code class=\"language-ts\">const ratelimit = new Ratelimit({\n  redis: Redis.fromEnv(),\n  limiter: Ratelimit.fixedWindow(10, &quot;20 s&quot;),\n});\nconst success = await ratelimit.limit(identifier);\n</code></pre>\n<p>If successful, then I forward the call to OpenAI, else rate-limited. Calling OpenAI&#x27;s endpoints is also very simple, thanks to their Node.js SDK.</p>\n<pre><code class=\"language-ts\">const summarized = await openai.createCompletion({\n\tmodel: &quot;text-curie-001&quot;,\n\tprompt: `List the key points from the following paragraph: &quot;&quot;&quot;${text}&quot;&quot;&quot;`,\n\tmax_tokens: 100,\n\ttemperature: 0,\n});\n\nreturn {\n  statusCode: 200,\n  headers: headers,\n  body: JSON.stringify({ message: summarized.data.choices[0].text }),\n}\n\n</code></pre>\n<p>Currently I&#x27;m using the Curie model for everyone, in the future I plan to build a system where complex text is given to the Da Vinci model. Also, this could be an opportunity to implement a premium tier for more than <em>x</em> calls to Da Vinci.</p>\n<h1>The Extension</h1>\n<p>Browser extensions are surprisingly complex.</p>\n<p>Each extension is made up of several files and pages:</p>\n<ul>\n<li><code>manifest.json</code>: this file specifies the files, permissions, assets the browser should load.</li>\n<li>The extension page: the mini-popup that is displayed when the user opens the extension from the toolbar. It&#x27;s essentially a mini-webpage with it&#x27;s own html, css and js (for manipulating the popup&#x27;s DOM)</li>\n<li>A background script (<code>background.js</code>) that listens to events from the webpage DOM and the mini-popup’s DOM.</li>\n<li>Some extensions also have a content script that can interact and manipulate the webpage’s DOM. Since my extension reads the webpage’s DOM only once, I use the <code>chrome.scripting</code> APIs instead of a full-fledged content script.</li>\n</ul>\n<h2>Grabbing the Selected Text</h2>\n<p>The background script places a button in the right-click menu when the user selects some text.</p>\n<pre><code class=\"language-js\">chrome.contextMenus.create({\n  id: &quot;skimmr.xyz-menu&quot;,\n  title: &quot;Skimmr&quot;,\n  contexts: [&quot;selection&quot;]\n});\n</code></pre>\n<p>The script listens for any clicks on the right-click-menu-button and on click, it grabs the selected text from the DOM and sends it to the serverless function.</p>\n<pre><code class=\"language-js\">chrome.contextMenus.onClicked.addListener(async (_info, _tab) =&gt; {...});\n</code></pre>\n<p>The selected text is grabbed via the <code>chrome.scripting.executeScript</code> function. This function executes the specified function (or script) in the context of the webpage&#x27;s DOM.</p>\n<pre><code class=\"language-js\">const res = await chrome.scripting.executeScript(\n  {\n    target: {tabId: tab.id},\n    func: getSelectedText\n  }\n);\nconst text = res[0].result;\n</code></pre>\n<p>Here, I get the tab id using <code>chrome.tabs.query</code> and <code>getSelectedText</code> uses the <code>window</code> API to get the selected text.</p>\n<pre><code class=\"language-js\">function getSelectedText() {\n  return getSelection().toString();\n}\n\nconst [ tab ] = await chrome.tabs.query({active: true, lastFocusedWindow: true});\n</code></pre>\n<p>This text is sent to the serverless function using a standard <code>fetch</code> call. The response is stored in browser memory, to be accessed by the extension page.</p>\n<pre><code class=\"language-js\">chrome.storage.session.set({ &#x27;selectedText&#x27;: response.message.slice(2,) });\n</code></pre>\n<p>Using storage to communicate between the background and extension is pretty hacky. I&#x27;m sure there&#x27;s a real communication interface, but this works for now. The response is sliced cuz the first two indices of response are always &quot;\\n\\n&quot;.</p>\n<h2>Updating UI with Summarized text</h2>\n<p>Since I&#x27;m using the storage to &quot;communicate&quot; between the background script and the extension page, the extension page listens to changes in the storage and updates the text box with the new text.</p>\n<pre><code class=\"language-js\">// index.js\nchrome.storage.onChanged.addListener((changes, _namespace) =&gt; {\n  explanationBox.innerText = changes.selectedText.newValue;\n});\n</code></pre>\n<p>All the UI updates (including the one above) are put inside an event listener for <code>DOMContentLoaded</code>. This event is is triggered when the user open the extension popup. This is done because to manipulate the DOM, the DOM must exist.</p>\n<pre><code class=\"language-js\">document.addEventListener(&quot;DOMContentLoaded&quot;, (_e) =&gt; {...}\n</code></pre>\n<p>There&#x27;s also a copy button which writes to your clipboard by <code>navigator.clipboard.writeText(explanationBox.textContent);</code> and a &quot;Re-skim&quot; button which refreshed the text.</p>\n<h3>Future Improvements</h3>\n<ul>\n<li>Use language models fine-tuned for specific tasks (summarization, explanation, explaining code).</li>\n<li>Differentiate between simple and complex input, then send to different models.</li>\n<li>Personalization, tiered accounts etc.</li>\n</ul>\n<h3>Tools used</h3>\n<ul>\n<li>Netlify (hosting)</li>\n<li>Upstash (Redis DB, Redis SDK, Rate-limiting package)</li>\n<li>Dotenv</li>\n<li>Astro (project site)</li>\n</ul>\n<h3>Links</h3>\n<ul>\n<li><a href=\"https://github.com/yashkarthik/skimmr\">Project Repo</a></li>\n<li><a href=\"https://skimmr.xyz\">Project Site</a></li>\n<li><a href=\"https://chrome.google.com/webstore/detail/skimmr/inchpcdcmkipekcoiimcdnfomdhdfcih\">Chrome Web Store</a></li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/skimmr",
            "title": "How Skimmr Works",
            "summary": "Browser extensions are convoluted.",
            "date_modified": "2022-12-26T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/diff-ppl-see-diff-things",
            "content_html": "<h1>Frames of References</h1>\n<p>People view the world from <a href=\"https://en.wikipedia.org/wiki/Frame_of_reference\">frames of reference</a>.\nIn this context, a frame of reference is information that is obvious to the person. It&#x27;s the\ninformation, and a set of assumptions, that they encounter or use everday.\nDifferent people&#x27;s frames consist of different sets of information that is obvious to them.\nA programer&#x27;s frame will have information about, well, programming.</p>\n<h1>Impact of Frames</h1>\n<p>The frame of reference impacts how the person views the world. This means that different people,\nessentially, see different things. They actually see the same thing, but absorb different\nsegments of knowledge from it. For example:</p>\n<ul>\n<li>A mathematician may look at a flower and marvel at the <a href=\"https://en.wikipedia.org/wiki/Fibonacci_number#Nature\">Fibonacci\nsequence</a> in its petal arrangement.</li>\n<li>A biologist may look at a flower and see its sex.</li>\n<li>A gardener may look at a flower and see that it needs more water.</li>\n</ul>\n<h2>Getting stuck in your frame</h2>\n<p>This means that it&#x27;s really easy to get <em>stuck</em>. Stuck in your current way of seeing and thinking;\nstuck in your current frame. Frames are made up of the details that seem important to <em>you</em>. The\ndetails which you haven&#x27;t noticed are invisible to you, and the details you\n<em>have</em> noticed seem completely obvious. This makes makes it difficult to see how you could\nmiss something important, and on the flip side it makes it hard for you to see how someone could miss\nsomething so obvious (related: <a href=\"https://en.wikipedia.org/wiki/Curse_of_knowledge\">Curse of Knowledge</a>).</p>\n<h1>Solution</h1>\n<p>When different people, who see different things, work together, they need to account for and\nappreciate the details one person sees that the other person doesn&#x27;t.</p>\n<blockquote>\n<p>If you wish to not get stuck, seek to perceive what you have not yet perceived.\n- <a href=\"http://johnsalvatier.org/\">John Salvatier</a></p>\n</blockquote>",
            "url": "https://www.yashkarthik.xyz/archive/diff-ppl-see-diff-things",
            "title": "Different People See Different Things",
            "summary": "If you wish to not get stuck, seek to perceive what you have not yet perceived.",
            "date_modified": "2022-10-17T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/social-scalability",
            "content_html": "<p>Why do humans run the world? We run the world because we are the only animal that can cooperate flexibly in large numbers. We socialize across genetic boundaries. Through stories and myths like religion, nationality and traditions.</p>\n<p>For effective cooperation, we organize ourselves into centralized hierarchies. But centralized enforcement and coordination breaks down at national borders. It is efficient within a country, but not universal. The cultural, jurisdictional, and intellectual diversity of people who participate in an institution is important, especially in the context of Internet. The more an institution depends on local laws, customs, or language, the less socially scalable it is.</p>\n<p>The past decade has shown us the reliability, and universality of blockchain-based coordination. It is less efficient, but operates across borders without relying on trust, and without human prejudice.</p>\n<p>While human efficiency has, more or less, remained constant for the past thousand years, computers have been doubling in power and efficiency, and halving in size every 2 years. With our super-fast computers, we can trade off some efficiency for a different kind of scalability. We can replace institutions that were traditionally centralized, to preserve efficiency, with <em>inefficient</em> blockchains that provide social scalability.</p>\n<blockquote>\n<p>Social scalability is the ability of an institution to overcome shortcomings in human minds and in the motivating or constraining aspects of said institution that limit who or how many can successfully participate. - Nick Szabo</p>\n</blockquote>\n<p><strong>Summary:</strong></p>\n<ul>\n<li>Human dominate the world because we can coordinate effectively, in large numbers.</li>\n<li>To make coordination efficient, we created centralized institutions.</li>\n<li>Centralized inst. are not good at overcoming shortcomings in human minds.</li>\n<li>Computers are super-efficient; their inefficient is better than our efficient.</li>\n<li>We can trade computational scalability for social scalability.</li>\n</ul>\n<p><strong>Further reading:</strong></p>\n<ul>\n<li><a href=\"https://fs.blog/why-humans-dominate-earth/\">fs.blog</a> - Yuval Noah Harari on Why Humans Dominate the Earth</li>\n<li><a href=\"https://unenumerated.blogspot.com/2017/02/money-blockchains-and-social-scalability.html\">unenumerated.blogspot.com</a> - Money, Blockchains, and Social Scalability</li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/social-scalability",
            "title": "Blockchains Scale Socially",
            "summary": "Bitcoin scales where the dollar doesn't - socially.",
            "date_modified": "2022-09-21T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/friend-caster",
            "content_html": "<p>I was just scrolling on <a href=\"https://farcaster.xyz\">Farcaster</a> and this cast scrolled onto my feed:</p>\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271172%27%20height=%27806%27/%3e\"/></span><img alt=\"The cast that gave me the idea to build Friendcaster.\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"The cast that gave me the idea to build Friendcaster.\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fidea-cast.9cad2fe6.png&amp;w=1200&amp;q=100 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fidea-cast.9cad2fe6.png&amp;w=3840&amp;q=100 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fidea-cast.9cad2fe6.png&amp;w=3840&amp;q=100\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\"></i></div>\n<p>I clicked on the link to see what <a href=\"https://chirpty.com/\">Chirpty</a> was, and felt that this would be a perfect project for me. It&#x27;s simple, but not too simple.</p>\n<h1>How it Works</h1>\n<p><em>All the code is available on <a href=\"https://github.com/yashkarthik/friendcaster\">Github</a></em></p>\n<p>This is the root dir of my project. I use typescript so I had to make some changes to <code>package.json</code> and <code>tsconfig.json</code> but the basic initialization was done via <code>npm init -y</code>.</p>\n<pre><code>├── index.ts\n├── src\n│   ├── api.ts\n│   ├── data.ts\n│   ├── final.ts\n│   └── image.ts\n└── views\n    ├── pages\n    │   ├── circle.ejs\n    │   ├── faq.ejs\n    │   └── index.ejs\n    └── partials\n        ├── footer.ejs\n        ├── head.ejs\n        └── header.ejs\n├── public\n│   ├── circle.png\n│   └── favicon.ico\n├── .env\n├── package.json\n├── tsconfig.json\n</code></pre>\n<p>The code is split into multiple files for better maintainability:</p>\n<ul>\n<li><code>index.ts</code> - this is the entry point into the application. It sets up the server (Express.js) and the relevant routes</li>\n<li><code>src/api.ts</code> - this contains a bunch of helper functions to fetch data from the smart contracts on the blockchain.</li>\n<li><code>src/data.ts</code> - this file processes the data we fetch to make it easier to make images using these.</li>\n<li><code>src/image.ts</code> - code to create image out of the data.</li>\n<li><code>src/final.ts</code> - a bunch of functions and constants to tie everything together and offer a single endpoint for our server to call into.</li>\n</ul>\n<h2>Fetching Data</h2>\n<p><code>src/api.ts</code></p>\n<p>We&#x27;ll need to understand a bit about how Farcaster stores user data, to understand the calls we make. Farcaster allows users to store their casts (tweets) on whatever server they wish to. The server could be AWS s3, a VPS on Digital Ocean or a Raspberry Pi under their desk. This keeps the cost of posting low (cuz storing data on the blockchain is high). But to incentivize the servers to not misbehave, users are able to switch the server that stores the data. The user just need copy their data to the new server and change the url in the <a href=\"https://rinkeby.etherscan.io/address/0xe3Be01D99bAa8dB9905b33a3cA391238234B79D1#code\">Farcaster Name Registry</a> - a smart contract that maps an address -&gt; username -&gt; url of the host directory.</p>\n<p>So to fetch a user&#x27;s posts we need to query the smart contract, with the username, to get the url of the server that stores their data, then query the data from that url.</p>\n<p>I&#x27;m using <code>ethers.js</code> to interact with the blockchain, and Alchemy as a node service.</p>\n<p>To get the url of a user&#x27;s host directory, we call the <code>getDirectoryUrl</code> function defined in the Name Registry Contract with the username formatted in <code>bytes32 string</code>. Then we get the data stored in the host directory using <a href=\"https://github.com/sindresorhus/got\"><code>got()</code></a>.</p>\n<pre><code class=\"language-js\">export const getDirectory = async (username: string, registryContract:any): Promise&lt;IDirectory&gt;  =&gt; {\n\n  const byte32Name = utils.formatBytes32String(username);\n  const directoryUrl = await registryContract.getDirectoryUrl(byte32Name);\n\n  const directoryResponse = await got(directoryUrl, { protocol: &#x27;https:&#x27; });\n  const directoryBody = JSON.parse(directoryResponse.body).body;\n\n  return {\n    directoryUrl,\n    directoryBody\n  };\n}\n</code></pre>\n<p>The data stored in the host directory is of the shape:</p>\n<pre><code>{\n  body: {\n    addressActivityUrl: &#x27;http://www.host.xyz/bob/casts.json&#x27;,\n    avatarUrl: &#x27;https://github.com/bob_the_builder.png&#x27;,\n    displayName: &#x27;Bob&#x27;,\n    proofUrl: &#x27;http://www.host.xyz/bob/proof.json&#x27;,\n    timestamp: 1624314341272,\n    version: 1,\n  },\n  merkleRoot: string,\n  signature: string,\n}\n</code></pre>\n<p>I&#x27;ve defined two more functions in this file is <code>getAvatarUrl, getAvatarListUrl</code>. They fetch the avatar url of a user and a list of users, respectively. They call <code>getDirectory</code> extract the url from the directory blob.</p>\n<pre><code class=\"language-js\">const { directoryBody } = await getDirectory(username, registryContract);\nconst avatarUrl = directoryBody.avatarUrl;\n</code></pre>\n<h2>Processing that data to look for posts that are replies</h2>\n<p><code>src/data.ts</code></p>\n<p>Farcaster stores all of user&#x27;s posts in the directory as a json file, that is referenced by the <code>directoryBody.addressActivityUrl</code>. The json file is shaped like this:</p>\n<pre><code>interface IAction {\n\n  body: Object;\n  merkleRoot: string;\n  signature: string;\n  meta: {\n    displayName: string;\n    avatar: string;\n    isVerifiedAvatar: boolean;\n    numReplyChildren: number;\n    reactions: Object;\n    recasts: Object;\n    watches: Object;\n    replyParentUsername?: {\n      address: string;\n      username: string;\n    }\n  }\n\n}\n\n</code></pre>\n<p>Reply posts have the <code>replyParentUsername</code> key defined while normal posts don&#x27;t have this key cuz they are the parent. To filter posts that are replies vs the posts that are just normal posts we define this filter on an array containing all the user&#x27;s timeline. We then map over the filtered array to fetch the username of the post our user replied to.</p>\n<pre><code>const addressActivity: IAction[] = JSON.parse(addressActivityResponse.body);\nconst repliedPeople: string[] = addressActivity.filter((action:IAction) =&gt; {\n  // check if the action is a associated with another user.\n  if (!action.meta.replyParentUsername) {\n    return false;\n  }\n\n  return true;\n}).map((action:any) =&gt; action.meta.replyParentUsername.username)\n</code></pre>\n<p>Now we have the username of everyone that we replied to. The final circle contains several rings, which represent our frequency of interaction. We need to add weights to the array we have.</p>\n<pre><code>const interactionFrequency: IFreqObj = interactedPeople.reduce((prevValue: any, currentValue: string) =&gt; {\n  return prevValue[currentValue] ? ++prevValue[currentValue] : prevValue[currentValue] = 1, prevValue\n}, {});\n\nconst tally: INameFreq[] | any[] = []\nfor (const [uname, freq] of Object.entries(interactionFrequency)) {\n  tally.push({\n      username: uname,\n      freq: freq\n  });\n}\n\ntally.sort((a:any, b:any) =&gt; b.freq - a.freq);\n</code></pre>\n<p>We add weight to our array of usernames using the reduce function. We then sort the array in the tally array.</p>\n<p>Next we add the caller&#x27;s username to the list, and the append portions of the array into a <code>result</code> array. This is mostly to handle the data for different rings separately.</p>\n<pre><code>head = [{username: username, freq: 0, avatarUrl: userUrl}, ...head];\n\nlet result: INameFreq[][] = []\nresult.push(head.splice(0, 1))\nresult.push(head.splice(0, 8))\nresult.push(head.splice(0, 15))\nresult.push(head.splice(0, 26))\nreturn result;\n</code></pre>\n<h2>Generating the Image</h2>\n<p><code>src/image.ts</code></p>\n<p>I basically copied the image generation style from <a href=\"https://blog.hackertyper.net/post/twitter-interaction-circles-guide/\">Chirpty</a> which uses <a href=\"https://github.com/Automattic/node-canvas\"><code>node-canvas</code></a>. MY <code>render</code> function accepts a config object of interface <code>IConfig</code> and writes the generated image to <code>public/circle.png</code>. Since I&#x27;m running Express.js I can set that image as my static directory and access the image from anywhere.</p>\n<pre><code class=\"language-ts\">interface IConfig {\n  users: INameFreq[];\n  count: number;\n  radius: number;\n  distance: number;\n}\n</code></pre>\n<h2>Tying everything into a single endpoint for the server:</h2>\n<p><code>src/final.ts</code></p>\n<p>This file contains the contract address and the contract ABI which are required to generate a contract instance. This file instantiates the contract and calls the <code>getInteractionFrequency</code> with it. then supplies the data to the <code>render</code> function.</p>\n<pre><code class=\"language-ts\">export async function createImage(username: string) {\n  const provider = new providers.AlchemyProvider(&#x27;rinkeby&#x27;, process.env.ALCHEMY_API_KEY);\n  const registryContract = new Contract(REGISTRY_CONTRACT_ADDRESS, REGISTRY_ABI, provider);\n\n  const block = await provider.getBlockNumber();\n  console.log(&quot;Block: &quot;, block);\n\n  const data = await getInteractionFrequency(username, registryContract)\n  await render([\n    {distance: 0,   count: 1,   radius: 110,    users: data[0]},\n\t  {distance: 300, count: 8,   radius: 80,     users: data[1]},\n\t  {distance: 400, count: 15,  radius: 50,     users: data[2]},\n\t  {distance: 500, count: 26,  radius: 30,     users: data[3]},\n  ]);\n};\n</code></pre>\n<h2>Setting up Express.js in</h2>\n<p><code>index.ts</code></p>\n<p>It contains generic code to setup some basic routes, and public directories. Only one route is of relevance here. It is the route that returns the interaction circle image.</p>\n<pre><code class=\"language-ts\">app.get(&quot;/circle/:username&quot;, (req, res, next) =&gt; {\n  let username = req.params.username;\n  if (username[0] == &#x27;@&#x27;) username = username.slice(1,);\n\n  createImage(username)\n    .then(e =&gt; {\n      setTimeout(() =&gt; (res.render(&#x27;pages/circle&#x27;), 1))\n    }).catch(next)\n});\n</code></pre>\n<p>When the user enters their username in the form (on the homepage), they are sent to the <code>/circle/&lt;username&gt;</code> route. This will trigger the function <code>createImage</code>, defined in <code>src/final.ts</code>. After the image has been written to <code>public/circle.png</code> file, we tell Express.js to render the page using <code>/views/pages/circle</code> view. The view contains an image tag which renders the interaction circle.</p>\n<h1>Conclusion</h1>\n<p>Friendcaster was the first project that people other than my irl family used. It was a real product. That helped people. And the response from the fc community was awesome. I got some really good feedback and feature ideas, and I feel that it would be a good idea to launch a version 2 of friendcaster.</p>\n<ul>\n<li>Consider other interactions (likes, recasts) in the calculation.</li>\n<li>Build a full-fledged frontend in React (maybe use Next.js). And offload image rendering here.</li>\n<li>Allow users to customize stuff: bg, profile outline, size etc.</li>\n<li>Use an outward spiral instead of multiple levels of circles.</li>\n<li>Replace the static canvas image with a dynamic animation thingy built via react</li>\n<li>Mint as nft. Store image on Arweave/IPFS.</li>\n<li>Hovering a profile should show who it is etc.</li>\n<li>Integrations with other Farcaster apps\n<ul>\n<li>farcasternews.xyz to show karma.</li>\n<li>@perl to show collections etc.</li>\n</ul>\n</li>\n<li>Serverless?</li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/friend-caster",
            "title": "How it Works: Friendcaster",
            "summary": "Ideas are cheap, execution is hard",
            "date_modified": "2022-09-08T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/nft-royalties",
            "content_html": "<p>I first read about people avoiding nft royalties on my Twitter feed. It was an angry tweet advocating for royalties for creators, and why <a href=\"https://twitter.com/_yashKarthik/status/1559902048468226049?s=20&amp;t=NQoeGlLjmiGNVXYvt_N9dw\" title=\"Twitter Thread\">Sudoswap</a> is cheating the system. The part about royalties caught my eye. I had no idea that royalties could even be excluded. This led me down the rabbit hole of token standards (ERC-20, ERC-721 etc) and how royalties are implemented in nft&#x27;s.</p>\n<p>Turns out there&#x27;s no way to implement royalties in the smart contract itself (yet). Each nft marketplace has its own implementation of royalties. When an nft is sold on that platform, it triggers a function on the server that gives the creator a cut. So if you sold an nft without using a platform, the server wouldn&#x27;t know, hence, the creator wouldn&#x27;t get any cut.</p>\n<h1>Why Royalties can&#x27;t be Implemented at a Contract Level</h1>\n<p>But royalties are one of the core advertised features of nft art. How come there&#x27;s no way to implement them within the contract? The problem becomes clear when you see these transactions from the blockchain&#x27;s perspective.</p>\n<p>The blockchain sees a smart contract (the nft), which has a function defined called <code>ownerOf</code>. This function returns an ethereum address (the owner). When the nft is sold, the blockchain is instructed to change the value of address in the contract. The blockchain doesn&#x27;t know anything about the <em>selling</em> of that contract. Thus, it doesn&#x27;t know anything about the transfer of eth that made the selling possible. The blockchain does not link the transfer of money to the transfer of an nft. Since it can&#x27;t link these two, it can&#x27;t facilitate royalties.</p>\n<p>Maybe in the future we&#x27;ll have <em>sellable nfts</em> that help the blockchain identify payment that are for nfts and then give the creators a cut. But until then, creators are gonna have to trust that people sell their nfts via marketplaces.</p>",
            "url": "https://www.yashkarthik.xyz/archive/nft-royalties",
            "title": "How NFT Royalties Actually Work",
            "summary": "Escape royalties through Sudoswap - an angry trader",
            "date_modified": "2022-08-18T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/jack-butcher",
            "content_html": "<p>Today Jack Butcher has an online audience of over 500k, earns $100,000 a month, and runs an infinitely scalable business. But just 4 years ago, in 2018, he was burnt out running an ad agency serving corporate clients. The insight behind this transition? Productizing himself.</p>\n<p>He started down the standard career path. Studying design at university and then spent a decade working in the industry. Bouncing around different jobs, picking up new skills, building connections. In 2018, he started his own advertising agency. Shooting videos, commercials, and full-stack creative work. Serving corporate clients as a single-person agency turned out to be super exhausting and he was feeling burnt out by the end of the year.</p>\n<p>But working on his business revealed some important things about the industry. He observed that clients weren&#x27;t coming to him for his skill-set. There was no reason to choose him over another agency specializing in (say) shooting video-commercials. He had built up a strong network at his previous jobs and his new agency was benefiting from that. He quickly understood that this wouldn&#x27;t be sustainable and he had to either scale up or pivot.</p>\n<ol>\n<li>He could hire either some designers, managers and scale his agency to handle corporate clients; or,</li>\n<li>Pivot the agency in one specific, narrow direction to eliminate competition.</li>\n</ol>\n<p>He chose to dig in and focus on a very specific part of the design process: pitch decks. A pitch deck is essentially a sort of presentation used to introduce and communicate an idea to win a job or contract. It itself is (usually) not the product. But he had spent so much time refining that process, he could build a brand around that as a product.</p>\n<p>But there were other&#x27;s doing this right? What was his <em>special sauce</em>?</p>\n<p>As a graphic designer he had to compete a massive pool of other designers. But by layering his skill as a artist with his expertise for understanding value, he created a whole new market with no competition. With no competition around he captured all demand and scaled it using media.</p>\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%27597%27%20height=%27351%27/%3e\"/></span><img alt=\"Venn Diagram representing Jack relative to the design industry.\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"Venn Diagram representing Jack relative to the design industry.\" srcSet=\"/_next/static/media/venn.e4bd05e4.svg 1x, /_next/static/media/venn.e4bd05e4.svg 2x\" src=\"/_next/static/media/venn.e4bd05e4.svg\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\"></i></div>\n<p>To conclude, these are the key insight we can draw from Jack&#x27;s journey:</p>\n<ol>\n<li>Hard skills are scalable, but fungible - meaning they can be easily replaced.</li>\n<li>Soft skills help you build connections and earn their trust. Professional connections are not fungible, but they&#x27;re not scalable/sustainable either.</li>\n<li>Specific knowledge is non-fungible, and it&#x27;s scalable. For example: Jack has a specific skill of understanding value, and conveying it through visuals.</li>\n</ol>\n<p><em>Thanks for reading!</em></p>",
            "url": "https://www.yashkarthik.xyz/archive/jack-butcher",
            "title": "How Jack Butcher Productized Himself",
            "summary": "Escape competition through autheticity - Naval Ravikant",
            "date_modified": "2022-08-10T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/lens",
            "content_html": "<p>Blockchains separate the backend from the frontend. <a href=\"https://twitter.com/LensProtocol\">@LensProtocol</a> takes this further by specialising the backend for social interactions. Here&#x27;s how it works.</p>\n<h2>Everything is an NFT! Literally.</h2>\n<p>Profiles, comments, follows, mirrors(retweets) are all nfts, or represented using nfts. This enables direct ownership of content and, programmability (cuz nfts are basically programmable objects).</p>\n<p>The main nfts are:</p>\n<ul>\n<li>ProfileNFT: ownership over this nft gives you control over your profile.</li>\n<li>Publications: these are posts, comments, mirrors all posted to a user&#x27;s profile and stored in the user&#x27;s wallet.</li>\n</ul>\n<p>A key feature of nfts is their inherent &quot;programmable&quot; nature. Lens Protocol leverages this in the form of modules.</p>\n<h2>Modules</h2>\n<p>Modules are whitelisted contracts that adhere to a specific interface.</p>\n<ul>\n<li>They have state and contain logic to be executed when a certain event occurs.</li>\n<li>Follow Modules: called when a user tries to follow a profile.</li>\n<li>Collect Module: executed when a user tries to collect a publication.</li>\n</ul>\n<p>... etc.</p>\n<p>These modules allow for logic such as &quot;fee-on-follow&quot; or even a &quot;subscription&quot; model. Basically any logic you can think up!</p>\n<h2>Monetization</h2>\n<p>Because creators own their content via the Lens Protocol, they can allow their followers to purchase that content as nfts. A creator can attach a collect module with arbitrary logic.</p>\n<p>Web2 turned websites from digital newspaper to social networks and shopping stores. It leveraged the programmable nature of the webpages. Similarly NFTs are programmable objects. By leveraging this @LensProtocol has built a decentralised, composable, user-owned social graph.</p>",
            "url": "https://www.yashkarthik.xyz/archive/lens",
            "title": "Lens Protocol Explained",
            "summary": "A decentralized, composable, user-owned social graph",
            "date_modified": "2022-08-09T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/dell-v-ibm",
            "content_html": "<ul>\n<li>1984: IBM earned $5 bn and a 19 yr old Micheal Dell incorporates Dell with $1000 of funding.</li>\n<li>2005: Dell earns $9 bn in profits while IBM&#x27;s pc div is sold to Lenovo.</li>\n</ul>\n<style data-emotion=\"css 1upb9tn\">.css-1upb9tn{border:0;border-bottom-width:1px;width:100%;}</style><hr aria-orientation=\"horizontal\" class=\"chakra-divider css-1upb9tn\"/>\n<p>In the 1970s personal computer was was an unfamiliar idea with the American people. Only businesses and universities used computers. IBM dominated this arena with 60% market share.</p>\n<p>As the personal computer market emerged in the early 80s, IBM was the time-tested, obvious choice for most consumers. It had a massive supply chain consisting of resellers and distributors to reach every corner of America. But their situation in the pc space was quite different:</p>\n<ul>\n<li>\n<p>In the mainframe-sector they built their own components, and wrote their own software.</p>\n</li>\n<li>\n<p>But for PCs, they outsourced the chip design to Intel and bought the OS from a startup called Microsoft.</p>\n</li>\n</ul>\n<p>The pc market grew so fast, even IBM couldn&#x27;t keep up with demand. Because of the massive demand, the dealers had trouble managing inventory and would often over-order and over-pay. To compensate for their loss, the dealers started selling the extra pc&#x27;s for dirt cheap: The IBM Grey-market.</p>\n<p>Soon enough, clones of IBM started popping up. One of these clones was Dell. But Dell was no ordinary clone.</p>\n<p>Dell obsessed over computers. Took them apart, modded them, and even resold them for a profit. While messing with computers, he realised that the components of IBM pcs cost between $600-$700. But the pcs were being sold at a huge markup of $3000.</p>\n<p>A large chunk of the $3000 went to the resellers. But the dealers didn&#x27;t really understand pcs. Most of them sold gadgets like stereos and stuff, and sold pcs cuz they seemed like the next big thing.</p>\n<p>• IBM couldn&#x27;t make PCs cheaper cus of their reseller network\n• But Dell knew the actual cost of the parts and knew where to buy them.</p>\n<p>While Dell realized that resellers were a cash-sink, most clones just blindly copied this from IBM. He had spotted a golden opportunity.</p>\n<style data-emotion=\"css 1upb9tn\">.css-1upb9tn{border:0;border-bottom-width:1px;width:100%;}</style><hr aria-orientation=\"horizontal\" class=\"chakra-divider css-1upb9tn\"/>\n<p><strong>Phase 1:</strong> Without having to pay resellers, Dell could massively undercut the competition.</p>\n<p>Word of his cheap, well performant pcs got around. Soon enough, professionals from nearby cities started coming to Dell for their pcs.</p>\n<p>But without e-commerce how did Dell reach the lengths-and-breadths of America?</p>\n<p><strong>Phase 2:</strong></p>\n<p>• Dell established a dedicated sales team instead of relying on resellers.</p>\n<p>• Different teams for B2C and B2B. Set it up such that a sales person&#x27;s background matched the client&#x27;s field. The sales team could then collect inputs and feedback for the engineers. Driving an iteration-feedback loop.</p>\n<p>As the scale of operations grew, Dell deployed the Just-In-Time model. This reduced their waste, improved cash-flow, and maximized profits.</p>\n<style data-emotion=\"css 1upb9tn\">.css-1upb9tn{border:0;border-bottom-width:1px;width:100%;}</style><hr aria-orientation=\"horizontal\" class=\"chakra-divider css-1upb9tn\"/>\n<p>Dell&#x27;s obsession over the industry enabled him to discovery key market insights that others simply glossed over. Enabling him to avoid the simple, small mistakes that toppled IBM.</p>\n<p>About 25 years after entering the pc market, IBM&#x27;s pc division was sold to Lenovo.</p>\n<p>TL;DR</p>\n<p>• Obsess over your industry. Discover the flaws in the market-leader&#x27;s plan.\n• Compete with the best in your market.\n• Read about emerging market. The fields that are growing so fast that big players can&#x27;t cater to the demands.</p>\n<p>Thanks for reading!</p>",
            "url": "https://www.yashkarthik.xyz/archive/dell-v-ibm",
            "title": "How Dell dethroned IBM",
            "date_modified": "2022-07-27T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/gitc-pass",
            "content_html": "<p>Open-source software is a digital public good that generates $400bn a year in value, but the creators of OSS are unable to monetize their work on this digital infrastructure. Gitcoin&#x27;s mission is to correct this asymmetry. And they&#x27;ve done a good job of it. Since its launch in Nov 2017,  Gitcoin has facilitated 2,733,950 complete transactions to 10,820 unique earners, facilitated 2819 grants and raised $65.4 million of funding for open source. It does this by providing members opportunity to earn and fund their work via bounties and grants.</p>\n<h1>Gitcoin Grants</h1>\n<p>Gitcoin Grants is a crypto-style Kickstarter which allows individuals to get funding for a public-goods project they are working on. It uses <a href=\"https://wtfisqf.com\">Quadratic Funding</a> to allocate funds to projects that the community actually prioritizes. Because quadratic funding weighs the number of contributors over the amount contributed, it&#x27;s susceptible to <strong>Sybil Attacks</strong>.</p>\n<h2>Sybil Attacks</h2>\n<p>Sybil attacks are also common in the web2 world: fake reviews on Amazon, fake accounts to sway polls etc. In the context of Gitcoin it generally involves a person creating multiple identities and using them to make multiple donations. For example: instead of sending $100 dollars from a single account, a person creates 100 accounts and sends $1 through each of them. Since quadratic funding weighs the number of donations over the amount donated, the malicious project will get a larger slice of the matching pool than if they donated via a single account.</p>\n<p>There are several ways to tackle this problem:</p>\n<ol>\n<li>Use machine learning to detect patterns so that the person must spend time impersonating a real human.</li>\n<li>Set a minimum donation amount.</li>\n<li>Identity verification</li>\n</ol>\n<p>The idea is that if a person has to spend time, effort and money to verify each identity, it dramatically reduces the potential gains from gaming the system.</p>\n<h2>Existing Solutions to Identity Verification</h2>\n<p>There are a lot of different ways &amp; methods to verify identity, for example:</p>\n<ul>\n<li>\n<p>Centralized solutions:</p>\n<ul>\n<li>National ID cards</li>\n<li>KYC, etc.</li>\n</ul>\n</li>\n<li>\n<p>web3 native solutions:</p>\n<ul>\n<li><a href=\"https://www.proofofhumanity.id/\">Proof of Humanity</a></li>\n<li><a href=\"https://www.brightid.org/\">BrightID</a></li>\n<li><a href=\"https://poap.xyz/\">Poap</a>, etc</li>\n</ul>\n</li>\n</ul>\n<p>To incentivize identity verification, Gitcoin created TrustBonus. It works by increasing the impact a donation has the more levels of verification the contributor has gone through. An unverified user starts with 50% of their contribution count towards the match fund. To increase their impact a user must verify their identity. The higher a user&#x27;s TrustBonus, the more we can be confident that the user is unique, and a larger percentage of the user&#x27;s donation counts towards the match fund.</p>\n<p>Gitcoin passport takes this further by serving as an identity aggregator that wraps your identity credentials, across web2 and web3, into a single composable identity.</p>\n<h1>Gitcoin Passport</h1>\n<p>The Gitcoin Passport aims to provide a secure infrastructure for digital identity by capturing the <em>intersectional</em> nature of identity in cryptographic wrappers called <strong>verifiable credentials</strong>.</p>\n<h2>How it Works</h2>\n<p>Identity providers (Google, Twitter, POAP, GitHub, BrightID) are used to establish &quot;personhood&quot; of a user through their direct ownership of social accounts and web3 assets. Once personhood is established, the credential or stamp is stored in the Passport as json data. Applications can read your passport and verify your identity. The more stamps a user has, the more confident the app can be that the user is indeed a human.</p>\n<h2>Tech behind it</h2>\n<p>The Passport is a collection of data credentials, created according to the DID [ <a href=\"https://www.w3.org/TR/did-core/\">decentralized identifiers</a> ] and VC [ <a href=\"https://www.w3.org/TR/vc-data-model/#introduction\">verifiable credentials</a> ] specs, stored on the Ceramic Network.</p>\n<h3>Ceramic Network</h3>\n<p>Most of the information on today&#x27;s internet is locked away on application-specific database servers with poor API integrations The siloed environment results in friction for developers and worse experience for users.</p>\n<p>Ceramic is a decentralized network for composable data, that extends the IPFS file system. Due to Ceramic&#x27;s permissionless network anyone in the world can openly build upon existing data without relying on a centralized server, integrate one-off APIs, or worry if the state of information being returned is correct.</p>\n<h1>Lifecycle of a Passport</h1>\n<ol>\n<li>User goes to <a href=\"passport.gitcoin.co\">passport.gitcoin.co</a> or a similar frontend, where the user is prompted to connect and collect stamps from various identity providers.</li>\n<li>User goes to an app and sign a message allowing the app access to their passport.</li>\n<li>The app uses <a href=\"https://github.com/gitcoinco/passport-sdk/tree/main/packages/reader\">Gitcoin Passport SDK Reader</a> to read the contents and and fetch data from Ceramic</li>\n<li>App must ensure that VCs were issued correctly using the <a href=\"https://github.com/gitcoinco/passport-sdk/tree/main/packages/verifier\">SDK Verifier</a>.</li>\n<li>The app now calculates user&#x27;s personhood score using the <a href=\"https://github.com/gitcoinco/passport-sdk/tree/main/packages/scorer\">SDK Scorer</a></li>\n<li>Depending on the user&#x27;s verification level, they&#x27;re granted certain rights and levels of access.</li>\n</ol>\n<h1>Conclusion</h1>\n<p>In conclusion, Gitcoin Passport is a way to store your existing identity crendentials in a decentralized and verifiable format.</p>\n<h2>FAQs</h2>\n<h3>What is stored in my passport?</h3>\n<p>The DID associated with your Ethereum address and the verifiable credential issued for each service. It&#x27;s stored as json.</p>\n<h3>Who can read this data</h3>\n<p>Anyone can read from Ceramic. But only you can write.</p>\n<h3>Doxxing</h3>\n<ul>\n<li>No personally identifiable information stored in passport.</li>\n<li>Unique identifier is stored in the VCs, which cannot be brute forced.</li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/gitc-pass",
            "title": "Gitcoin Passport Explained",
            "summary": "Verifiable personhood",
            "date_modified": "2022-06-27T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/nuke-energy",
            "content_html": "<p>Like fossil fuels, nuclear energy is produced by performing <em>some</em> reaction, which heats up water, spinning the turbines and generating electricity. In the case of oil, the reaction is combustion; a chemical reaction where the re-arrangement of bonds releases energy. Nuclear energy, like the name suggests, is generated when we alter the nucleus in nuclear reactions.</p>\n<h1>Fission</h1>\n<p>The nucleus is made up of protons and neutrons held together, against the electromagnetic repulsion of protons, by the strong nuclear force. The strong force acts as a sort of rubber band, storing the potential energy of the EM force. Cutting this rubber band would rip the nucleus apart and release the energy.</p>\n<p>A neutron is a convenient way to deliver a punch to the nucleus and disturb it from it&#x27;s spherical shape. The nucleus can hold itself together only if it remains spherical. If it begins to wobble into an elliptical shape, then the minor axis tends to neck down and pinch off into two nuclei plus a few loose neutrons. Those two daughter nuclei then repel each other electrostatically and fly off with great speed.</p>\n<h1>Fusion</h1>\n<p>Fusion energy is released when two small nuclei fuse together forming a larger nucleus and a lot of energy.</p>\n<p>But where did that energy come from? Where was it before the fusion?</p>\n<p>Since nucleus is essentially a bunch of protons and neutrons, the mass of a nucleus should be equal to the sum of the masses of the neutrons and protons. But the mass of a nucleus is lower than the sum of the masses of its protons and neutrons. What happened to that mass?</p>\n<p>So there&#x27;s missing mass, and unexplained energy.</p>\n<p>Einstein&#x27;s equation <code>E = mc^2</code> explains that mass and energy are just different manifestations of each other. The difference in mass is released as energy, when the nucleus is formed.</p>\n<h3>Conclusion</h3>\n<ul>\n<li>The energy released during fission was present as potential energy, due to the suppression of electromagnetic force.</li>\n<li>The energy released during fusion was present as mass of protons and neutrons.</li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/nuke-energy",
            "title": "Nuclear Energy - where's the energy coming from",
            "date_modified": "2022-06-17T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/nouns-cc0",
            "content_html": "<p>Traditional companies lead with fear of losing ownership. If someone&#x27;s making money selling t-shirts with Mickey on it, that is money Disney&#x27;s losing - <strong>direct value attribution</strong>.</p>\n<p>CC0 is essentially LEGO for ideas - composable IP. Why? Cuz memes run people&#x27;s minds. Releasing IP into public domain increases points of discovery, and enables anyone to build upon it; i.e more cool stuff and more people interacting with it - <strong>indirect value attribution</strong>.</p>\n<p>The result? With monopoly power gone, creators will compete on quality and creativity of experience they provide. In other words: more people wearing Mickey shirts ⇒ more ppl thinking about Mickey ⇒ more potential for building on top of Mickey.</p>\n<h3>Some links</h3>\n<ul>\n<li><a href=\"https://nouns.wtf/\">Nouns</a></li>\n<li><a href=\"https://creativecommons.org/share-your-work/public-domain/cc0/\">CC0</a></li>\n<li><a href=\"https://twitter.com/punk4156\">@punk4156</a></li>\n<li><a href=\"https://twitter.com/jackbutcher\">@jackbutcher</a></li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/nouns-cc0",
            "title": "Nouns and CC0",
            "summary": "Composable ideas",
            "date_modified": "2022-03-21T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/bootstrap-rollup",
            "content_html": "<p>Bootstrapping a rollup remains an unsolved problem. It&#x27;s similar to the early days of dapps. Anyone could clone Uniswap and offer 10<em>x</em> the yield. Most dapps resorted to some sort of tokenization (ICOs, air drops) to incentivize users to use their dapp long enough to form a <a href=\"https://twitter.com/divine_economy/status/1446150773251977216\" title=\"twitter\">community-moat</a>  around it.</p>\n<blockquote>\n<p>Tokens help overcome the bootstrap problem by adding financial utility when application utility is low - Chris Dixon</p>\n</blockquote>\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%27576%27%20height=%27293%27/%3e\"/></span><img alt=\"Bootstrapping using tokens\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"Bootstrapping using tokens\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fbootstrap-token.7b0bf81e.png&amp;w=640&amp;q=100 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fbootstrap-token.7b0bf81e.png&amp;w=1200&amp;q=100 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fbootstrap-token.7b0bf81e.png&amp;w=1200&amp;q=100\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\"></i></div>\n<p>Rollups too could launch their own token, see Coindesk&#x27;s <a href=\"https://www.coindesk.com/layer2/2022/03/02/what-tokenization-could-do-for-ethereum-scaling-solutions/\">article</a> on this. Another way to get more users onto your platform would be subsidizing the first <em>x</em> transactions.</p>\n<h1>Subsidizing Transactions</h1>\n<p>A rollup&#x27;s smaller user base means that each user has to pay a large fraction of the fees, increasing the cost per tx, and chasing away existing users. With a larger user base the gas will be split between more users and each user would pay a smaller fraction of the fees ⇒ lower cost per tx.</p>\n<p>A rollup that offers free transactions for (say) 10 days after its launch will attract a large user base at the start, essentially eliminating the bootstrap phase.. With a large user base, even after stopping the subsidies, each user would have to pay a small fraction of the fee. Rollups achieve a sort of <em>economies of scale</em> when more people use them. Cost of each transaction falls when there are more transactions.</p>\n<p><img src=\"/blog-assets/bootstrap-sub-tx.svg\" alt=\"Bootstrapping by subsidizing\"/></p>\n<h2>Potential Downsides</h2>\n<p>An obvious flaw: projects with large funding can extend this free transaction phase longer, and outlast competition. I&#x27;ll be updating this list as I come across other ways to <em>game</em> the market.</p>",
            "url": "https://www.yashkarthik.xyz/archive/bootstrap-rollup",
            "title": "Bootstrapping a Rollup",
            "summary": "Rollups achieve economies of scale when more people use them",
            "date_modified": "2022-03-13T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/nft-law",
            "content_html": "<h3>NFTs</h3>\n<ul>\n<li>They are a representation of an off-chain asset / network. A network of fans, art etc.</li>\n<li>They form a connection between the chain and the community.\n<ul>\n<li>They enable on-chain scarcity.</li>\n<li>The community must protect / enforce off-chain scarcity.</li>\n</ul>\n</li>\n</ul>\n<h3>Copyrights</h3>\n<p>A copyright is a type of intellectual property that gives its owner the exclusive right to copy and distribute a creative work, usually for a limited time. [ <a href=\"https://en.wikipedia.org/wiki/Copyright\">from Wikipedia</a> ]</p>\n<h1>How are they related?</h1>\n<p>Both seem to be doing the same thing - establishing a connection between the asset and the creator, providing them with ownership over their work, and enabling uniqueness. The only difference being that NFTs are not (yet) recognized by law.</p>\n<p>When someone copies and tries to profit off someone else&#x27;s work, the creator can file a suit. The connection between NFTs and reality is held up by the community - the community decides which smart contract on the blockchain represents the off-chain asset.</p>\n<p><strong>Example:</strong> There are hundreds of CryptoPunk clones but they are still considered unique.</p>\n<ol>\n<li>The clones don&#x27;t have the same contract address, thus on-chain uniqueness is preserved.</li>\n<li>The community chooses to value the original tokens - the original contract <em>is</em> the CryptoPunk.</li>\n</ol>\n<p>Maybe governments should recognize blockchains as neutral grounds for registering copyrights.</p>",
            "url": "https://www.yashkarthik.xyz/archive/nft-law",
            "title": "NFTs are copyright",
            "date_modified": "2022-02-10T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/defi-matrix",
            "content_html": "<p><em>Core ideas taken from <a href=\"https://twitter.com/balajis\">Balaji Srinivasan&#x27;s</a> <a href=\"https://www.youtube.com/watch?v=BKfnj9SrzCY\">appearence on the Tim Ferris Show</a></em></p>\n<h3>What is it?</h3>\n<ul>\n<li>Order books for everything.</li>\n<li>A way to represent each asset digitally, and trade them like coin pairs.</li>\n</ul>\n<h3>What it allows</h3>\n<ul>\n<li>The wallet enables <em>competition</em> between all assets.</li>\n<li>They allow us to price, compare, and trade things we never could. Example: a byte on my hard-disk for a minute of your CPU?</li>\n</ul>\n<h3>How is this different from existing markets?</h3>\n<ul>\n<li><strong>Everything is liquid:</strong> everything can be exchanged for everything else without having to convert to cash.</li>\n<li>This reduces the amount of wealth held in cash because it depreciates.</li>\n</ul>\n<h3>Analogy</h3>\n<p>Google News indexed all newspapers and made every local newspaper compete against every other. This killed newspapers that didn&#x27;t do real reporting. The DeFi matrix will make every digital asset compete against every other. It will work as a check on the power of institutions that control fiat.</p>\n<h1>What&#x27;s so big about this?</h1>\n<ul>\n<li>Order books offer a <em>first principles</em> view of how supply and demand work.</li>\n<li>Tokens enable measurement and representation of things like space and time.</li>\n<li>Wallets and digital markets combine these two by enabling live comparison and liquidity between these assets.</li>\n</ul>",
            "url": "https://www.yashkarthik.xyz/archive/defi-matrix",
            "title": "Summarizing Balaji's DeFi Matrix",
            "summary": "Order books, but for everything",
            "date_modified": "2022-01-27T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/pow-de-consensus",
            "content_html": "<p>Suppose I give Alice 10 dollars and she later gives 5 dollars to Bob. Historically, we represented such transactions by transferring an object - cash. With the internet, transacting via physical cash became impractical, so we came up with ledgers. Then the problem was who maintains the truth-ness of the ledger? Historically, we trusted the banks, and governments with the ledger. This gave them immense power and control over the flow and creation of money. But now Bitcoin has the craziest answer you could imagine - everyone maintains a copy of the ledger.</p>\n<p>Anyone running a node maintains a copy of the ledger since it&#x27;s dawn, keeping track of Bitcoin&#x27;s history and incoming transactions. Keeping power over the system in the hands of users.</p>\n<h1>How does this actually work?</h1>\n<p>Every transaction is broadcast out into the world, where nodes add it to their own copy of the ledger.</p>\n<p><strong>Problem</strong>: How to agree on the right ledger? When nodes receive transactions, how can they be sure that everyone else also received the same transaction.</p>\n<p>We need a protocol for how to accept or reject transactions, and in what order, so that you can be sure that anyone else in the world following the same protocol, has the same ledger as you.</p>\n<h1>Proof of Work</h1>\n<p>If we use computational work as a basis for what to trust, you can make it so that fraudulent transactions are <em>computationally infeasible</em>.</p>\n<p>Proof of work is a cryptographic proof in which the prover proves to others that a certain amount of <em>computational effort</em> has been expended.</p>\n<h2>Computational Work</h2>\n<p>Suppose that someone shows you a list of transactions, and they say &quot;I found a special number so that when you put this number at the end of the list of transactions, and apply <a href=\"wikipedia:SHA-2\">SHA-256</a> to the entire thing, the first 100 digits of the output are all zeros&quot;. How hard do you think it was for them to find that number? It must have been <em>really hard</em>.</p>\n<p>But once you know the number, you can quickly verify that this hash really does start with 100 zeros. You can verify that they went through a large amount of work without having to go through that same effort yourself. This number is called a <em>proof of work</em>.</p>\n<p><strong>NOTE:</strong> The purpose of proof of work algorithms is <em>not</em> proving that certain work was carried out, but deterring manipulation of data by establishing large energy and hardware requirements to be able to do so. [ <a href=\"https://en.bitcoinwiki.org/wiki/51%25_attack\">51% Attacks</a> ]</p>\n<h1>Applying Proof of Work</h1>\n<p>For our decentralized ledger, we want a way for everyone to agree on the correct state of the ledger.</p>\n<p>The core idea behind the bitcoin is to have everybody trust whichever ledger has the most computational work put into it. So even though there is no central authority, and everyone is maintaining their own copy of the blockchain, if everyone <em>agrees</em> to give preference to whichever blockchain has the most work put into it, we have a way to arrive at decentralized consensus.</p>\n<h2>Longest Chain rule</h2>\n<p>If you hear two miners broadcasting distinct blockchains with conflicting transaction histories, you defer to the longest one, i.e, the one with the most work put into it. If there&#x27;s a tie, wait until you hear an additional block that makes one longer.</p>\n<p>Technically it&#x27;s not the longest chain, it&#x27;s the chain with the most work invested in it, it usually happens to be the longest chain. Learn about the difference <a href=\"https://bitcoin.stackexchange.com/questions/29742/strongest-vs-longest-chain-and-orphaned-blocks/29744#29744\">here</a>.</p>\n<h3>Why do nodes prefer the longest chain</h3>\n<ol>\n<li>Resolving disagreements when two blocks are mined at the same time</li>\n<li>Protecting blocks already mined on to the blockchain.</li>\n</ol>\n<h3>Incentive for miners to build on the longest chain</h3>\n<p>A miner can claim a block reward if they are able to mine a block. Plus, the coins from this block reward can only be spent if the block is in the longest chain. The block reward incentivizes miners to always try and mine new blocks on top of the longest chain.</p>\n<h1>Conclusion</h1>\n<p>The usual framework of coins made from digital signatures, provides strong control of ownership, but is incomplete without a way to prevent double-spending. To solve this, Satoshi introduced a p2p network that uses Proof of Work to record a public history of transactions which quickly becomes computationally impractical for an attacker to change if honest nodes control a majority of CPU power.</p>\n<p>It allows human who don&#x27;t know, trust each other who never reveal identities, location etc to transact securely.</p>\n<h2>Sources and references:</h2>\n<ul>\n<li><a href=\"https://bitcoin.org/en/bitcoin-paper\">Bitcoin whitepaper</a></li>\n<li><a href=\"https://learnmeabitcoin.com/\">Learn Me Bitcoin</a></li>\n<li><a href=\"https://michaelnielsen.org/ddi/how-the-bitcoin-protocol-actually-works/\">michaelnielsen.org</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=bBC-nXj3Ng4\">3b1b - But how does Bitcoin actually\nwork?</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=Lx9zgZCMqXE\">CuriousInventor - How Bitcoin Works Under the\nHood</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=_160oMzblY8\">Anders Brownworth - Blockchain 101 - A Visual\nDemo</a></li>\n<li><a href=\"https://en.wikipedia.org/\">Wikipedia</a> and\n<a href=\"https://en.bitcoin.it/wiki/Main_Page\">various</a> <a href=\"https://developer.bitcoin.org/devguide/index.html\">bitcoin</a> <a href=\"https://en.bitcoinwiki.org/wiki/Bitcoin\">wikis</a></li>\n<li>And ton&#x27;s of random questions on he internet!</li>\n</ul>\n<p><em>Thanks for reading :)</em></p>",
            "url": "https://www.yashkarthik.xyz/archive/pow-de-consensus",
            "title": "How Proof of Work enables Decentralized Consensus",
            "summary": "Using computational work as a basis for what to trust",
            "date_modified": "2022-01-07T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        },
        {
            "id": "https://www.yashkarthik.xyz/archive/ethState",
            "content_html": "<p>Bitcoin is often described as a distributed ledger which facilitates a decentralized currency using cryptographic tools.</p>\n<p>A cryptocurrency behaves like a “normal” currency because of the rules governing the modification of the ledger. For example, a Bitcoin address cannot spend more Bitcoin than it owns. These rules underpin all transactions on Bitcoin and many other blockchains.</p>\n<p>While Ethereum follows almost the same exact rules, it also enables a much more powerful function: smart contracts. For this complex feature, a more sophisticated analogy is required. Instead of a distributed ledger, Ethereum is a distributed state machine.</p>\n<p><em>Originally posted on <a href=\"https://mirror.xyz/yashkarthik.eth/lZf4_3qZK4F0Z1pbiYD5N5R4vXQoPnii0AzJyFdNGbI\">mirror.xyz</a></em></p>\n<h1>State</h1>\n<p>The World State is a data structure made up of smaller objects representing accounts. An account is a mapping between the <em>address</em> and <em>account state</em>. <strong>The world state consists of objects that have an internal state.</strong></p>\n<p><img src=\"/blog-assets/world-state.png\" alt=\"Ethereum World State\"/></p>\n<h2>Structure of State</h2>\n<p>More accurately, the World State is stored as a <a href=\"https://eth.wiki/en/fundamentals/patricia-tree\">Merkle Patricia Trie</a> where accounts (and account data) are the leaves on the tree. The root node, and all the other intermediate nodes, are computed by hashing the hashes of the leaves/nodes below them.</p>\n<p>Any change in the data on the leaves propagates to an inconsistency higher up the trie.</p>\n\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%272088%27%20height=%271480%27/%3e\"/></span><img alt=\"test\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"test\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fmerkle-tree.3cc33b99.png&amp;w=3840&amp;q=100 1x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fmerkle-tree.3cc33b99.png&amp;w=3840&amp;q=100\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\">The value of a node depends on the value of the leaves.</i></div>\n<p>Why hash a tree instead of the data itself? Merkle proofs. They allow us to authenticate large amounts of data with just the root node of the tree containing the data. <a href=\"https://blog.ethereum.org/2015/11/15/merkling-in-ethereum/\">More about Merkling</a></p>\n<h1>Transactions as State Modifications</h1>\n<p>The EVM behaves like a math function - given an input, it produces a deterministic output. The EVM takes in the current state, applies some transactions on it; and outputs the next valid state - * a state transition function *.</p>\n<p><code>f(s, t) = s&#x27;</code></p>\n<p>Where:</p>\n<ul>\n<li><code>s</code> is an old valid (world) state;</li>\n<li><code>s’</code> is the new (world) state;</li>\n<li><code>t</code> is a new block of valid transactions;</li>\n<li><code>f</code> is the state transition function.</li>\n</ul>\n<p>The definite rules for changing state from block to block are defined in the EVM.</p>\n\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271660%27%20height=%27764%27/%3e\"/></span><img alt=\"Transactions as state modifications\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"Transactions as state modifications\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Ftx-state-mod.79d5d341.png&amp;w=1920&amp;q=100 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Ftx-state-mod.79d5d341.png&amp;w=3840&amp;q=100 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Ftx-state-mod.79d5d341.png&amp;w=3840&amp;q=100\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\">Transactions as state modifications</i></div>\n<p>Each transition modifies only some parts of the world state - account states with transactions executed on them.</p>\n<p>There is a lot to transactions that I didn’t cover, but it’s about how transactions are executed and confirmed, and does not relate to state transitions.</p>\n<h2>State change within an Account</h2>\n<blockquote>\n<p>An account is a mapping between an address and the account state.</p>\n</blockquote>\n<p>The account state consists of four fields: <code>nonce, balance, codeHash, storageRoot.</code></p>\n\n<p><strong>Nonce:</strong> the number of txs sent from the account. It prevents a tx from being processed more than once. For a contract account it represents the number of contracts it has created.</p>\n<ul>\n<li>A transaction, by a human owned account, changes the nonce and balance in the account state.</li>\n<li>A tx, by a contract account, also changes the <code>storageRoot</code> (storage hash) in the account state.</li>\n</ul>\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271080%27%20height=%27607%27/%3e\"/></span><img alt=\"Etherem account structure\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"Etherem account structure\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Feth-account.6bbe61b5.png&amp;w=1080&amp;q=100 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Feth-account.6bbe61b5.png&amp;w=3840&amp;q=100 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Feth-account.6bbe61b5.png&amp;w=3840&amp;q=100\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\">Structure of an account</i></div>\n<h1>State storage</h1>\n<p>So where is all this data stored? The blockchain implicitly stores state in the block headers, along with other data.</p>\n\n<style data-emotion=\"css 1iu1318\">.css-1iu1318{margin-top:10px;margin-bottom:10px;text-align:center;}</style><div class=\"css-1iu1318\"><span style=\"box-sizing:border-box;display:inline-block;overflow:hidden;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;position:relative;max-width:100%\"><span style=\"box-sizing:border-box;display:block;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0;max-width:100%\"><img style=\"display:block;max-width:100%;width:initial;height:initial;background:none;opacity:1;border:0;margin:0;padding:0\" alt=\"\" aria-hidden=\"true\" src=\"data:image/svg+xml,%3csvg%20xmlns=%27http://www.w3.org/2000/svg%27%20version=%271.1%27%20width=%271922%27%20height=%27918%27/%3e\"/></span><img alt=\"State storage\" src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\"/><noscript><img alt=\"State storage\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fstate-storage.e90d204c.png&amp;w=2048&amp;q=100 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fstate-storage.e90d204c.png&amp;w=3840&amp;q=100 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fstate-storage.e90d204c.png&amp;w=3840&amp;q=100\" decoding=\"async\" data-nimg=\"intrinsic\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%\" loading=\"lazy\"/></noscript></span><style data-emotion=\"css qu42dx\">.css-qu42dx{font-size:0.85em;}</style><i class=\"chakra-text css-qu42dx\">Each block header contains the hash of the root node of the &quot;World State Trie&quot;</i></div>\n<p>An archival node might store all txs and the resulting state transitions (including invalid states) for all blocks in their local disk. This will require large disk storage and is not strictly necessary.</p>\n<p>Conceptually blockchain data can be separated into:</p>\n<ul>\n<li>Chain data: the list of blocks forming the chain.</li>\n<li>State data: the result of each state transition.</li>\n</ul>\n<p>The chain data must be stored, to ensure verifiable custody (or transfer) of assets. But old state can be discarded, as its value can be known only from computation.</p>\n<p>So currently, while both chain and state data are stored locally on the node&#x27;s disk, only the chain data is strictly necessary.</p>\n<h1>Conclusion</h1>\n<p>In essence, state is exactly what it sounds like. It is the status or condition of each account on the Ethereum blockchain, stored across nodes participating in the network. And the EVM, as a state transition machine, executes operations on this shared world state as requested by users and contracts.</p>\n<blockquote>\n<p>Ethereum, taken as a whole, can be viewed as a transaction-based state machine: we begin with a genesis state and incrementally execute transactions to morph it into some current state. It is this current state which we accept as the canonical “version” of the world of Ethereum - The Ethereum Yellow Paper</p>\n</blockquote>\n<h2>Sources and references</h2>\n<ul>\n<li><a href=\"https://ethereum.org/en/developers/docs/\">ethereum.org</a></li>\n<li><a href=\"https://takenobu-hs.github.io/downloads/ethereum_evm_illustrated.pdf\">EVM Illustrated</a></li>\n<li><a href=\"https://blog.ethereum.org/2015/11/15/merkling-in-ethereum/\">Merkle tries on blog.ethereum.org</a></li>\n<li>Ethereum Stack Exchange:\n<ul>\n<li><a href=\"https://ethereum.stackexchange.com/questions/15288/ethereum-merkle-tree-explanation\">Ethereum merkle tree explanation</a></li>\n<li><a href=\"https://ethereum.stackexchange.com/questions/110639/what-is-the-difference-between-blockchain-state-and-the-ethereum-singleton\">Blockchain state</a></li>\n<li><a href=\"https://ethereum.stackexchange.com/questions/359/where-is-the-state-data-stored\">State storage</a></li>\n<li><a href=\"https://ethereum.stackexchange.com/questions/268/ethereum-block-architecture\">Block architecture</a></li>\n</ul>\n</li>\n</ul>\n<p>And tons of random question on the internet!</p>\n<p><em>Thanks for reading :)</em></p>",
            "url": "https://www.yashkarthik.xyz/archive/ethState",
            "title": "What is State in Ethereum [Mirror]",
            "summary": "From a global ledger to a decentralized state machine",
            "date_modified": "2021-12-14T18:30:00.000Z",
            "author": {
                "name": "yashkarthik.eth",
                "url": "https://twitter.com/_yashKarthik"
            }
        }
    ]
}